//HelloWorld.cpp - първа програма.

#include <iostream>
/*

#include <filename>

Това се нарича препроцесорна директива. Всички редове започващи с 
# са такива директиви и се изпълняват по време на компилация. Те НЕ участват в бинарния код на програмата.

Директивата include означава "сложи всичко от <file> ето тук." В повечето случаи това е еквивалентно с това да copy-paste-нем съдържанието на 
даден файл на мястото на include-да.
*/


/* 

int main ()

Това е функцията main. Тя е първата функция която се изпълнява във всяка една C++ програма. 
Следователно за да бъде една програма изпълняема (executable), тя трябва да има main функция.
*/
int main()
/*
{ } - с къдрави скоби означаваме т.нар. блок. Блокът е група от инструкции (код), които се изпълняват при определени условия - в случая
при извикване на функцията main.
*/
{
	/*
	Това е инструкция, която в случая е единствената в програмата ни.
	Всяка една инструкция трябва да завършва със знака ;
	
	В случая тази инструкция означава "Изведи на стандартния изход текста "Hello World!". Стандартния изход в повечето случаи е някаква конзола. 
	В нашия случай също е така, затова на конзолата се показва точно този текст. 
	*/
	std::cout << "Hello World!";
}
